app/controllers/replies_controller.rb

INSERT INTO "messages" ("body", "to", "from") VALUES ($1, $2, $3) RETURNING "id"  [["body", "Responding to"], ["to", "2315771805"], ["from", "+12319422552"]]
---
  def index
    render plain: "This number isn't read by anybody - so your message about '#{params[:Body]}' has gone into a black hole."
    Message.create(body: params[:Body], to: ENV['FROM_NUMBER'], from: params[:From])